{
  "display_name": "Thermoformer Packer",
  "description": "<p><strong>Position Summary:</strong><br>We are seeking a detail-oriented and safety-focused individual to join our manufacturing team. In this role, you will be responsible for inspecting, packing, and organizing thermoformed products, ensuring they meet company and customer quality standards. You will work closely with machine operators and other team members to maintain a smooth, efficient, and safe production process.</p><p><strong>Essential Job Functions:</strong></p><ul><li><p><strong>Inspect thermoformed products</strong> for defects, dimensional accuracy, and overall appearance to meet quality requirements.</p></li><li><p><strong>Pack finished products</strong> according to company specifications, ensuring correct labeling, stacking, and safe placement in containers.</p></li><li><p><strong>Maintain a clean and organized work area</strong> and follow all safety protocols to prevent accidents.</p></li><li><p><strong>Collaborate with production team members</strong> and promptly report issues or equipment malfunctions to the operator or supervisor.</p></li><li><p><strong>Protect products during work in progress (WIP)</strong> to prevent damage and ensure they meet all quality and customer specifications.</p></li><li><p><strong>Assist with inventory control</strong> by labeling and storing finished products properly.</p></li><li><p><strong>Follow all safety guidelines</strong> and wear appropriate personal protective equipment (PPE).</p></li><li><p><strong>Support Thermoformer Operators</strong> with safety, quality, and production requirements.</p></li><li><p>Perform <strong>additional tasks assigned</strong> by the Thermoformer Operator or supervisor.</p></li><li><p><strong>Assist in other manufacturing areas</strong> when needed to support production goals.</p></li></ul><p><strong>Qualifications:</strong></p><ul><li><p>Ability to work in a fast-paced manufacturing environment.</p></li><li><p>Strong attention to detail and commitment to quality.</p></li><li><p>Ability to lift and move materials as required.</p></li><li><p>Willingness to follow safety rules and wear required PPE.</p></li><li><p>Team-oriented with good communication skills.</p></li></ul><p></p>",
  "screening_email": "<p>Hi, I am Paul from Career March Solutions.</p>\n\n<p>Based on your application for the Thermoformer Packer, we believe you would be a great fit.</p>\n\n<p>Please reply to this email answering the following questions and someone from the recruiting team will call you soon:</p>\n\n<ol>\n  <li>What is your current pay (monthly / hourly)?</li>\n  <li>What's the earliest you can start, after getting the offer?</li>\n  <li>What's your availability for a phone screening call? please provide two time slots?</li>\n  <li>Do you have experience in inspecting and packing thermoformed products according to quality standards?</li>\n  <li>Are you willing to follow all safety guidelines and wear appropriate personal protective equipment (PPE)?</li>\n</ol>\n\n<p>Thanks,<br>\nAll the best,<br>\nPaul , CMS</p>",
  "criteria": "<p>The candidate's response should follow all specific rules to be aligned with the profile:</p><ol><li><p>Earliest joining date should be in the next <strong>1 month</strong></p></li><li><p>Do you have experience in inspecting and packing thermoformed products according to quality standards?</p></li><li><p>Are you willing to follow all safety guidelines and wear appropriate personal protective equipment (PPE)?</p></li></ol><p></p>",
  "title": null,
  "location": {
    "city": "hardeeville",
    "state": "sc",
    "postal_code": null
  },
  "country_code": "",
  "is_hot": false,
  "salary": "",
  "remote_type": "",
  "max_rate": "$12-$14",
  "duration": "",
  "start_date": "",
  "openings": 1,
  "status": "Active",
  "status_id": 47864,
  "date_created": "2025-08-13T16:29:32+00:00",
  "date_modified": "2025-09-23T13:51:48+00:00",
  "category_name": "none",
  "type": "H",
  "company": {
    "id": "1436748",
    "name": "Career Match Solutions",
    "state": "FL",
    "postal_code": "33569"
  },
  "application_forms": [
    {
      "id": "6274",
      "description": "General Application"
    }
  ],
  "owner": {
    "id": "554305",
    "first_name": "Kirt",
    "last_name": "Eure"
  },
  "recruiter": {
    "id": "554305",
    "first_name": "Kirt",
    "last_name": "Eure"
  },
  "job_id": 16716663,
  "is_active": 1,
  "created_at": null,
  "updated_at": null,
  "created_by": null,
  "assigned_user": {
    "id": 3,
    "name": "Eitan Haik",
    "email": "eitan@genai-labs.io"
  }
}

